[
    [
        {
            "headerTitle": "Getting started with Calendar",
            "headerSubtitle": "You can use Planner Calendar to keep track of all your dates",
            "bodyTitle": "Get Planner Calendar",
            "points": [
                "Go to Planner on your system.",
                "Navigate to Calendar from a side bar link.",
                "You can also navigate to the same from the apps in the header."
            ]
        },
        {
            "headerTitle": "Switch between months",
            "headerSubtitle": "Use the navigation arrows switch between consecutive months",
            "bodyTitle": "Navigation by arrows",
            "points": [
                "The arrows in the top bar of the calendar can be used to switch between consecutive months.",
                "Click the forward ( ˃ ) arrow to jump to the next month.",
                "As soon you reach the last month of an year, forward arrow takes you to first month of next year.",
                "Click the back ( ˂ ) arrow to jump to the previous month.",
                "As soon you reach the first month of an year, back arrow takes you to last month of previous year."
            ]
        },
        {
            "headerTitle": "Jump to any date",
            "headerSubtitle": "Use Jump to Month for jumping to random month",
            "bodyTitle": "Jumping to random month",
            "points": [
                "The Jump to Month button in the bottom right corner of the app allows to jump to any desired month",
                "Click on the button to do so.",
                "In the dialog box type the month and year to reach to.",
                "You can also use the native month selector by the button in right corner in the textfield to select a month."
            ]
        }
    ],
    [
        {
            "headerTitle": "Getting started with Events",
            "headerSubtitle": "You can use Planner Events to keep track of all your events",
            "bodyTitle": "Get Planner Events",
            "points": [
                "Go to Planner on your system.",
                "Navigate to Events from a side bar link.",
                "You can also navigate to the same from the apps in the header."
            ]
        },
        {
            "headerTitle": "Events navigation",
            "headerSubtitle": "Use the navigation arrows to show more events",
            "bodyTitle": "Navigation by arrows",
            "points": [
                "The events in the menu are arranged in ascending order of their dates, from past to future.",
                "The arrows in the top bar of the Events section can be used to scroll through all events.",
                "Click the up ( ˄ ) arrow to show previous events.",
                "As soon you reach the oldest event, you won't be able to scroll any further.",
                "Click the down arrow ( ˅ ) to show next events.",
                "As soon you reach the last event, you won't be able to scroll any further."
            ]
        },
        {
            "headerTitle": "Add a new event",
            "headerSubtitle": "Add an event when you want to remember the day.",
            "bodyTitle": "Adding a new event",
            "points": [
                "Press the add new event button in bottom right corner of the app",
                "If you are using Planner the first time, you can also press Add a new event button in the center.",
                "Enter the title, description, event type and the date of event",
                "Press Save to save your changes.",
                "To discard the new event Press Cancel or the close ( ❌ ) button in topbar."
            ]
        },
        {
            "headerTitle": "Edit an event",
            "headerSubtitle": "Edit the event whenever required",
            "bodyTitle": "Edit the event",
            "points": [
                "Click on the event you want to edit ",
                "Click on the edit ( ✏️ ) icon in the top of the event popup.",
                "The 'edit event' popup contains the original details of the events.",
                "To edit the event click on any event and type / select the desired content.",
                "Click on Save button to save your changes.",
                "To discard your changes, press cancel or close the popup by clicking on cross ( ❌ ) button."
            ]
        },
        {
            "headerTitle": "Event types",
            "headerSubtitle": "Customize your events with event types",
            "bodyTitle": "Event Types",
            "points": [
                "Event types are different types of general events people generally use.",
                "In planner, There are 5 types of default customized events: Birthday, Anniversary, Meeting, Festival, Ceremony.",
                "To add a customized event type: in the new event popup, click on the arrow in the right corner of ' Type ' text field and select the desired event type.",
                "You can also change the event type in edit event dialog box",
                "If your required event type is not in the list, you can always type the name."
            ]
        },
        {
            "headerTitle": "Delete an event",
            "headerSubtitle": "Delete when the event is not required anymore",
            "bodyTitle": "Deleting an event",
            "points": [
                "If the event is not required anymore, you can always delete it.",
                "To delete an event, click on any event to open it.",
                "Navigate to the delete icon in the top right corner of the popup dialog box.",
                "Press the delete button to delete it.",
                "WARNING: This action can't be undone, you will not be asked for confirmation, so proceed carefully."
            ]
        }
    ],
    [
        {
            "headerTitle": "Getting started with Notes",
            "headerSubtitle": "You can create, edit, and share notes with Planner Notes.",
            "bodyTitle": "Get Planner Notes",
            "points": [
                "Go to Planner on your system.",
                "Navigate to Notes from a side bar link.",
                "You can also navigate to the same from the apps in the header."
            ]
        },
        {
            "headerTitle": "Create a note",
            "headerSubtitle": "Add a note whenever a thought crosses your mind",
            "bodyTitle": "Add a new note",
            "points": [
                "Press the add new note button in bottom right corner of the app",
                "If you are using Planner the first time, you can also press Add a new note button in the center.",
                "Enter the title and note and link (if required).",
                "Press Save to save your changes.",
                "To discard the new note Press Cancel or the close ( ❌ ) button in topbar."
            ]
        },
        {
            "headerTitle": "Edit a note",
            "headerSubtitle": "Edit the note whenever required",
            "bodyTitle": "Edit the note",
            "points": [
                "Click on the edit ( ✏️ ) icon in the bottom navigation of the note or the note popup.",
                "The 'edit note' popup contains the original note.",
                "To edit the note click on any textfield and edit it as desired.",
                "Click on Save button to save your changes.",
                "To discard your changes, press cancel or close the popup by clicking on cross ( ❌ ) button."
            ]
        },
        {
            "headerTitle": "Delete a note",
            "headerSubtitle": "Delete the note to remove it from the app",
            "bodyTitle": "Deleting a note",
            "points": [
                "If the note is not required anymore, you can always delete it.",
                "To delete a note, click on the delete button in the bottom navigation of the note.",
                "You can also navigate to the delete icon in the bottom bar of the popup dialog box.",
                "WARNING: This action can't be undone, you will not be asked for confirmation, so proceed carefully."
            ]
        },
        {
            "headerTitle": "Note links",
            "headerSubtitle": "Use note links to remeber an external page on the web",
            "bodyTitle": "Using Note Links",
            "points": [
                "Note links is a newly introduced feature in the Planner Notes.",
                "To use Note Links in a new note, copy the URL in 'Link URL' text field and the text to shown in 'Link Text' textfield.",
                "To use note links in an existent note, press on 'edit-link' button in the bottom navigation of the note or the note popup.",
                "Leaving the textfield empty will apply no link to any external page."
            ]
        },
        {
            "headerTitle": "Copy a note",
            "headerSubtitle": "Share your thoughts with your friends, family and other people",
            "bodyTitle": "Copying an event",
            "points": [
                "A planner note can be easily copied to clipboard for sharing and further use.",
                "To copy an event, click on the 'copy-note' button in the bottom navigation of the note.",
                "You can also navigate to the copy icon in the note popup dialog box.",
                "Your desired note will be copied to the clipboard with its title, content and link(if any)."
            ]
        },
        {
            "headerTitle": "Note colors",
            "headerSubtitle": "Customize your Planner notes by Note colors",
            "bodyTitle": "Using Note Colors",
            "points": [
                "Note Colors is a newly introduced feature in the Planner Notes.",
                "To use note colors in an existing note, press the 'change color' button on the respective note.",
                "You can also navigate to the 'change color' button in the note popup dialog box.",
                "Hover over any color to see its name.",
                "Click on the desired color to apply it to the note.",
                "Click on Save button to save changes.",
                "To discard your changes, click on the Cancel button or the cross ( ❌ ) in the topbar"
            ]
        }
    ],
    [
        {
            "headerTitle": "Getting started with Tasks",
            "headerSubtitle": "You can manage your tasks with Planner Tasks.",
            "bodyTitle": "Get Planner Tasks",
            "points": [
                "Go to Planner on your system.",
                "Navigate to Tasks from a side bar link.",
                "You can also navigate to the same from the apps in the header."
            ]
        },
        {
            "headerTitle": "Tasks navigation",
            "headerSubtitle": "Manage your completed and not-completed tasks efficiently",
            "bodyTitle": "Management",
            "points": [
                "To manage your tasks, Planner tasks section has been divided in two parts, completed and non completed tasks",
                "The top section contains your to-do tasks that haven't been completed yet.",
                "The bottom section contains the tasks that have been completed.",
                "The Completed Tasks section is hidden by default.",
                "To review the completed tasks: click on the up arrow ( ˄ ) in the right corner of header of the completed tasks."
            ]
        },
        {
            "headerTitle": "Add a new task",
            "headerSubtitle": "Add a task everytime to remind you at right time",
            "bodyTitle": "Add a new task",
            "points": [
                "Press the add new task button in bottom right corner of the app",
                "If you are using Planner the first time, you can also press Add a new task button in the center.",
                "Enter the title, date and time of the task and description(if required).",
                "Press Save to save your changes.",
                "To discard the new task Press Cancel or the close ( ❌ ) button in topbar."
            ]
        },
        {
            "headerTitle": "Edit a task",
            "headerSubtitle": "Edit the task whenever required",
            "bodyTitle": "Edit the task",
            "points": [
                "Click on the edit ( ✏️ ) icon in the right of the task.",
                "The 'edit task' popup contains the original task.",
                "To edit the task click on any textfield and edit it as desired.",
                "Click on Save button to save your changes.",
                "To discard your changes, press cancel or close the popup by clicking on cross ( ❌ ) button."
            ]
        },
        {
            "headerTitle": "Delete a task",
            "headerSubtitle": "Delete the task to remove it from the app",
            "bodyTitle": "Deleting a task",
            "points": [
                "If the task is not required anymore, you can always delete it.",
                "To delete a task, click on the delete button in the right corner of the task.",
                "WARNING: This action can't be undone, you will not be asked for confirmation, so proceed carefully."
            ]
        },
        {
            "headerTitle": "Task date and time",
            "headerSubtitle": "Set date and time efficiently",
            "bodyTitle": "Using task Links",
            "points": [
                "Planner Tasks can now set date and time by native date and time selectors.",
                "Click on the date and time icons in the right corner of a textfield.",
                "Planner tasks also arrange your tasks in the ascending order of date and time."
            ]
        }
    ],
    [
        {
            "headerTitle": "Planner's themes",
            "headerSubtitle": "Planner Themes: Light and Dark",
            "bodyTitle": "Switch between Planner Themes",
            "points": [
                "The Planner app has been made in two color themes: Light and Dark.",
                "To toggle between light and dark themes, click on the Sun/Moon icon in the header.",
                "By deafult the app starts with a light mode from 7:00 AM to 8:00 PM.",
                "During night i.e.) from 8:00 PM to morning 7:00 AM app starts with a default dark theme."
            ]
        },
        {
            "headerTitle": "Color palette",
            "headerSubtitle": "Planner Color Palette",
            "bodyTitle": "Planner colors",
            "points": [
                "Primary Colors with their weights",
                "Secondary Colors with their weights"
            ]
        }
    ]
]